//Разработать классы DOG и MASTER
//1. DOG(Кличка, вес, возраст).
//   MASTER(ФИО; ID клуба – константа; Собаки – возможно
//    несколько!; count – статический счетчик создаваемых членов клуба).
//    Также реализовать следующие пункты.
//2. Наличие множества конструкторов для инициализации объектов класса.
//3. Реализовать инкапсуляцию(методы set / get) для изменения сведений о собаках и их
//    владельцах.
//Для тестирования программы создать двух владельцев собак.У первого – две собаки, у второго – одна.Для
//    каждого вывести ФИО, ID клуба и информацию по всем собакам.А также – количество членов
//    клуба.

#include <iostream>
#include "Dog.h"
#include "Master.h"
using namespace std;

int main()
{
    
}